Revit 2027 API
BuiltInFailures.RegenFailures.CircularDependencyConstraint Property
 Highlighted constraints cause a circular chain of references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircularDependencyConstraint { get; }
Public Shared ReadOnly Property CircularDependencyConstraint As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircularDependencyConstraint {
	FailureDefinitionId^ get ();
}
static member CircularDependencyConstraint : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace